In [1]:
import numpy as np 
import pandas as pd

In [2]:
date=pd.read_csv(r"D:\100 Days machine learning\Handling date and time day 34\orders.csv")

In [55]:
time = pd.read_csv(r"D:\100 Days machine learning\Handling date and time day 34\messages.csv")

In [3]:
 date.head(4)

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1

In [56]:
time.head(4)

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [57]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with date

In [8]:
date['date']=pd.to_datetime(date['date'])

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

## Extract year

In [10]:
date['date_year']=date['date'].dt.year

In [12]:
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

In [18]:
date['Month Name']=date['date'].dt.month_name()

In [19]:
date.head()

        date  product_id  city_id  orders  date_year     Month Month Name
0 2019-12-10        5628       25       3       2019  December   December
1 2018-08-15        3646       14     157       2018    August     August
2 2018-10-23        1859       25       1       2018   October    October
3 2019-08-17        7292       25       1       2019    August     August
4 2019-01-06        4344       25       3       2019   January    January

In [23]:
date['Month']=date['date'].dt.month

In [25]:
date.head()

        date  product_id  city_id  orders  date_year  Month Month Name
0 2019-12-10        5628       25       3       2019     12   December
1 2018-08-15        3646       14     157       2018      8     August
2 2018-10-23        1859       25       1       2018     10    October
3 2019-08-17        7292       25       1       2019      8     August
4 2019-01-06        4344       25       3       2019      1    January

In [26]:
date['day']=date['date'].dt.day

In [27]:
date.head()

        date  product_id  city_id  orders  date_year  Month Month Name  day
0 2019-12-10        5628       25       3       2019     12   December   10
1 2018-08-15        3646       14     157       2018      8     August   15
2 2018-10-23        1859       25       1       2018     10    October   23
3 2019-08-17        7292       25       1       2019      8     August   17
4 2019-01-06        4344       25       3       2019      1    January    6

In [28]:
date['day_of_week']=date['date'].dt.dayofweek

In [29]:
date.head()

,date,product_id,city_id,orders,date_year,Month,Month Name,day,day_of_week
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [30]:
date['date_dow_name'] = date['date'].dt.day_name()
date.head()

,date,product_id,city_id,orders,date_year,Month,Month Name,day,day_of_week,date_dow_name
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday

In [31]:
date['date is weekend']=np.where(date['date_dow_name'].isin(['Sunday','Saturday']),1,0)

In [32]:
date.head()

,date,product_id,city_id,orders,date_year,Month,Month Name,day,day_of_week,date_dow_name,date is weekend
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1

In [36]:
date['week_num'] = date['date'].dt.isocalendar().week

In [37]:
date.head()

,date,product_id,city_id,orders,date_year,Month,Month Name,day,day_of_week,date_dow_name,date is weekend,week_num
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1,1

In [39]:
date['quarter']=date['date'].dt.quarter

In [40]:
date.head()

,date,product_id,city_id,orders,date_year,Month,Month Name,day,day_of_week,date_dow_name,date is weekend,week_num,quarter
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1,1,1

In [41]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

# Extract Time elapsed between dates

In [44]:
import datetime

In [45]:
today = datetime.datetime.today()

today

datetime.datetime(2025, 1, 20, 19, 1, 8, 518840)

In [46]:
today - date['date']

0     1868 days 19:01:08.518840
1     2350 days 19:01:08.518840
2     2281 days 19:01:08.518840
3     1983 days 19:01:08.518840
4     2206 days 19:01:08.518840
                 ...
995   2296 days 19:01:08.518840
996   2237 days 19:01:08.518840
997   2085 days 19:01:08.518840
998   2150 days 19:01:08.518840
999   1924 days 19:01:08.518840
Name: date, Length: 1000, dtype: timedelta64[ns]

In [47]:
(today - date['date']).dt.days

0      1868
1      2350
2      2281
3      1983
4      2206
       ...
995    2296
996    2237
997    2085
998    2150
999    1924
Name: date, Length: 1000, dtype: int64

In [49]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, 'm'),0)

0      2691061.0
1      3385141.0
2      3285781.0
3      2856661.0
4      3177781.0
         ...
995    3307381.0
996    3222421.0
997    3003541.0
998    3097141.0
999    2771701.0
Name: date, Length: 1000, dtype: float64

In [50]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [58]:
# Converting to datetime datatype
time['date']=pd.to_datetime(time['date'])

In [59]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [60]:
time['hour']=time['date'].dt.hour

In [61]:
time['minute']=time['date'].dt.minute

In [62]:
time['second']=time['date'].dt.second

In [63]:
time.head()

,date,msg,hour,minute,second
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [64]:
time['time']=time['date'].dt.time

In [65]:
time.head()

,date,msg,hour,minute,second,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [66]:
today - time['date']

0     4054 days 18:11:08.518840
1     3918 days 19:21:08.518840
2     4404 days 18:40:08.518840
3     3706 days 18:30:08.518840
4     4103 days 19:50:08.518840
                 ...
995   4693 days 18:11:08.518840
996   4014 days 19:47:08.518840
997   4479 days 19:24:08.518840
998   4595 days 19:27:08.518840
999   3867 days 19:36:08.518840
Name: date, Length: 1000, dtype: timedelta64[ns]

In [67]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.503311e+08
1      3.385849e+08
2      3.805728e+08
3      3.202650e+08
4      3.545706e+08
           ...
995    4.055407e+08
996    3.468808e+08
997    3.870554e+08
998    3.970780e+08
999    3.341794e+08
Name: date, Length: 1000, dtype: float64

In [68]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      5.838851e+06
1      5.643081e+06
2      6.342880e+06
3      5.337750e+06
4      5.909510e+06
           ...
995    6.759011e+06
996    5.781347e+06
997    6.450924e+06
998    6.617967e+06
999    5.569656e+06
Name: date, Length: 1000, dtype: float64

In [69]:

(today - time['date'])/np.timedelta64(1,'h')

0       97314.185700
1       94051.352366
2      105714.669033
3       88962.502366
4       98491.835700
           ...
995    112650.185700
996     96355.785700
997    107515.402366
998    110299.452366
999     92827.602366
Name: date, Length: 1000, dtype: float64